import { Link } from 'react-router-dom';

const PrivacyPolicyPage = () => {
  return (
    <div className='flex flex-col items-center justify-center h-full text-center gap-y-7 px-7'>
      <div className='text-xl'>개인정보 처리방침</div>
      <div>
        Refesta는 Google API에서 받은 정보를 사용하고 다른 앱으로 전송하는 것은 제한된 사용 요구 사항을 포함하여{' '}
        <Link
          className='text-blue-500 underline'
          to='https://developers.google.com/terms/api-services-user-data-policy'
        >
          Google API 서비스 사용자 데이터 정책
        </Link>
        을 준수합니다.
      </div>
      <div>
        Refesta 은(는) 정보주체의 자유와 권리 보호를 위해 「개인정보 보호법」 및 관계 법령이 정한 바를 준수하여,
        적법하게 개인정보를 처리하고 안전하게 관리하고 있습니다. 이에 「개인정보 보호법」 제30조에 따라 정보주체에게
        개인정보 처리에 관한 절차 및 기준을 안내하고, 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여
        다음과 같이 개인정보 처리방침을 수립·공개합니다.
      </div>
      <div>▪ 개인정보의 처리목적 </div>
      <div>
        Refesta 은(는) 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는
        이용되지 않으며, 이용 목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등 필요한
        조치를 이행할 예정입니다.
      </div>
      <div>1. 회원 가입 및 관리 </div>
      <div>
        회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 만 14세
        미만 아동의 개인정보 처리 시 법정대리인의 동의여부 확인, 각종 고지·통지, 고충처리 목적으로 개인정보를
        처리합니다.
      </div>
      <div>▪ 개인정보의 처리 및 보유기간 </div>
      <div>
        ① Refesta 은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은 개인정보
        보유·이용기간 내에서 개인정보를 처리· 보유합니다.
      </div>
      <div>② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.</div>
      <div>1. 홈페이지 회원 가입 및 관리 : 사업자/단체 홈페이지 탈퇴 시까지 </div>
      <div>다만, 다음의 사유에 해당하는 경우에는 해당 사유 종료 시까지 </div>
      <div>1） 관계 법령 위반에 따른 수사·조사 등이 진행 중인 경우에는 해당 수사·조사 종료 시까지 </div>
      <div>2） 홈페이지 이용에 따른 채권·채무관계 잔존 시에는 해당 채권·채무관계 정산 시까지 </div>
      <div>▪ 처리하는 개인정보 항목 </div>
      <div>Refesta 은(는) 다음의 개인정보 항목을 처리하고 있습니다. </div>
      <div>1. 회원 가입 및 관리 </div>
      <div>• 필수항목 : 성명, 이메일주소</div>
      <div>• 선택항목 : 프로필사진</div>
      <div>▪ 14세 미만 아동의 개인정보 처리에 관한 사항 </div>
      <div>
        ① Refesta 은(는) 만 14세 미만 아동에 대해 개인정보를 수집할 때 법정대리인의 동의를 얻어 해당 서비스 수행에
        필요한 최소한의 개인정보를 수집합니다.
      </div>
      <div>• 필수항목 : 법정 대리인의 성명, 관계, 연락처</div>
      <div>
        ② Refesta 은(는) 만 14세 미만 아동의 개인정보를 수집할 때에는 아동에게 법정대리인의 성명, 연락처와 같이 최소한의
        정보를 요구할 수 있으며, 법정대리인에게 동의 내용을 알리고 동의 의사표시를 확인합니다.
      </div>
      <div>▪ 개인정보의 제3자 제공 </div>
      <div>
        ① Refesta 은(는) 정보주체의 개인정보를 개인정보의 처리 목적에서 명시한 범위 내에서만 처리하며, 정보주체의 동의,
        법률의 특별한 규정 등 개 「개인정보 보호법」 제17조 및 제18조에 해당하는 경우에만 개인정보를 제3자에게 제공하고
        그 이외에는 정보주체의 개인정보를 제3자에게 제공하지 않습니다
      </div>
      <div>
        ② Refesta 은(는) 다음과 같이 재난, 감영병, 급박한 생명·신체 위험을 초래하는 사건·사고, 급박한 재산 손실 등의
        긴급상황이 발생하는 경우 정보주체의 동의 없이 관계기관에 개인정보를 제공할 수 있습니다.
      </div>
      <div>
        이 경우 Refesta 은(는) 근거법령에 의거하여 필요한 최소한의 개인정보만을 제공하며, 목적과 다르게 제공하지
        않겠습니다.
      </div>
      <div>▪ 개인정보의 파기 절차 및 방법 </div>
      <div>
        ① Refesta 은(는) 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당
        개인정보를 파기합니다.
      </div>
      <div>
        ② 정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음 에도 불구하고 다른 법령에 따라
        개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여
        보존합니다.
      </div>
      <div>③ 개인정보 파기의 절차 및 방법은 다음과 같습니다. </div>
      <div>
        1. 파기절차 은(는) 파기 사유가 발생한 개인정보를 선정하고, 의 개인정보 보호책임자의 승인을 받아 개인정보를
        파기합니다.
      </div>
      <div>
        2. 파기방법 은(는) 전자적 파일 형태로 기록·저장된 개인정보는 기록을 재생할 수 없도록 파기하며, 종이 문서에
        기록·저장된 개인정보는 분쇄기로 분쇄 하거나 소각하여 파기합니다.
      </div>
      <div>▪ 미이용자의 개인정보 파기(파기하는 경우) </div>
      <div>
        ① Refesta 은(는) 1년간 서비스를 이용하지 않은 이용자의 정보를 파기하고 있습니다. 다만, 다른 법령에서 정한
        보존기간이 경과할 때까지 다른 이용자의 개인정보와 분리하여 별도로 저장·관리할 수 있습니다.
      </div>
      <div>
        ② Refesta 은(는) 개인정보의 파기 30일 전까지 개인정보가 파기되는 사실, 기간 만료일 및 파기되는 개인정보의 항목을
        이메일, 문자 등 이용자에게 통지 가능한 방법으로 알리고 있습니다.
      </div>
      <div>③ 개인정보의 파기를 원하지 않으시는 경우, 기간 만료 전 서비스 로그인을 하시면 됩니다.</div>
      <div>▪ 정보주체와 법정대리인의 권리·의무 및 행사방법 </div>
      <div>
        ① 정보주체는 Refesta 에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다. ※ 만
        14세 미만 아동에 관한 개인정보의 열람등 요구는 법정대리인이 직접 해야 하며, 만 14세 이상의 미성년자인 정보주체는
        정보주체의 개인정보에 관하여 미성년자 본인이 권리를 행사하거나 법정대리인을 통하여 권리를 행사할 수도 있습니다.
      </div>
      <div>
        ② 권리 행사는 Refesta 에 대해 「개인정보 보호법」 시행령 제41조 제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을
        통하여 하실 수 있으며, 은(는) 이에 대해 지체없이 조치하겠습니다.
      </div>
      <div>
        ③ 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수도 있습니다. 이 경우 “개인정보
        처리 방법에 관한 고시(제2020-7호)” 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
      </div>
      <div>
        ④ 개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제35조 제4항, 제37조 제2항에 의하여 정보주체의 권리가
        제한 될 수 있습니다.
      </div>
      <div>
        ⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를
        요구할 수 없습니다.
      </div>
      <div>
        ⑥ Refesta 은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리 정지의 요구 시 열람 등 요구를 한 자가
        본인이거나 정당한 대리인인지를 확인합니다.
      </div>
      <div>▪ 개인정보의 안전성 확보조치</div>
      <div>Refesta 은(는) 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.</div>
      <div>1. 관리적 조치 : 내부관리계획 수립·시행, 전담조직 운영, 정기적 직원 교육 </div>
      <div>2. 기술적 조치 : 개인정보처리시스템 등의 접근권한 관리</div>
      <div>3. 물리적 조치 : 전산실, 자료보관실 등의 접근통제</div>
      <div>▪ 개인정보 자동 수집 장치의 설치·운영 및 거부에 관한 사항 </div>
      <div>
        ① Refesta 은(는) 이용자에게 개별적인 맞춤서비스를 제공하기 위해 이용 정보를 저장하고 수시로 불러오는
        ‘쿠키(cookie)’를 사용합니다.
      </div>
      <div>
        ② 쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며
        이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다.
      </div>
      <div>가. 쿠키의 사용목적: 이용자에게 최적화된 정보 제공을 위해 사용됩니다. </div>
      <div>
        나. 쿠키의 설치·운영 및 거부 : 웹브라우저 상단의 도구 〉 인터넷 옵션 〉 개인정보 메뉴의 옵션 설정을 통해 쿠키
        저장을 거부 할 수 있습니다.
      </div>
      <div>다. 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.</div>
      <div>▪ 개인정보 보호책임자 </div>
      <div>
        ① Refesta 은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및
        피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
      </div>
      <div>‣ 개인정보 보호책임자 </div>
      <div>성명 : 이지원 </div>
      <div>직책 : 팀원 </div>
      <div>연락처 : dlwldnjs950@gmail.com</div>
      <div>▪ 권익침해 구제방법 </div>
      <div>
        ① 정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원
        개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에
        대하여는 아래의 기관에 문의하시기 바랍니다.
      </div>
      <div>1. 개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr) </div>
      <div>2. 개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr) </div>
      <div>3. 대검찰청 : (국번없이) 1301 (www.spo.go.kr) </div>
      <div>4. 경찰청 : (국번없이) 182 (ecrm.cyber.go.kr)</div>
      <div>
        ② Refesta 은(는) 정보주체의 개인정보자기결정권을 보장하고, 개인정보 침해로 인한 상담 및 피해 구제를 위해
        노력하고 있으며, 신고나 상담이 필요한 경우 아래로 연락해 주시기 바랍니다.
      </div>
      <div>
        ‣ 개인정보보호 관련 고객 상담 및 신고
        <div>성명 : 이지원 </div>
        <div>직책 : 팀원 </div>
        <div>연락처 : dlwldnjs950@gmail.com</div>
        <div>
          ③ 「개인정보 보호법」 제35조(개인정보의 열람), 제36조(개인정보의 정정·삭제), 제37조(개인정보의 처리정지 등)의
          규정에 의한 요구에 대하여 공공기관의 장이 행한 처분 또는 부작위로 인하여 권리 또는 이익의 침해를 받은 자는
          행정심판법이 정하는 바에 따라 행정심판을 청구할 수 있습니다.
        </div>
        <div>▸ 중앙행정심판위원회 : (국번없이) 110 (www.simpan.go.kr)</div>
      </div>
    </div>
  );
};

export default PrivacyPolicyPage;
